# encoding: utf-8
mapper = {  # monthly
    "ip_yoy": "M0000545",
    "ip_cyoy": "M0000011",
    "cpi": "M0000612",
    "cpif": "M0000616",
    "cpinf": "M0000613",
    "cpicore": "M0085932",
    "ppi": "M0001227",
    # daily
    "gz10y": "S0059749",
    "gz1y": "M1001646",
    "gz3y": "M1001648",
    "gz5y": "M1001650",
    "gz7y": "M1001652",
    "gk10y": "M1004271",
    "gk5y": "M1004267",
    "gk1y": "M1004687",
    "gc007": "204007.SH",
    "gc001": "204001.SH",
    "gc014": "204014.SH",
    "gc028": "204028.SH",
    "gc091": "204091.SH",
    "brent": "S0260035",  # 布伦特原油活跃期货合约结算价
    "1yfr007": "M0048486",
    "5yfr007": "M0048490",
    "M2": "M0001385",
    "水泥价格指数": "S5914515",
    "CRB": "S0031505",
    "gz10yind": "CBA04501.CS",
    "玻璃综合指数": "S5907372",
    "螺纹钢": "S5707798",
    "fai_cyoy": "M0000273"
}
